; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	image6 - mode
	image1 - mode
	image5 - mode
	spectrograph4 - mode
	thermograph2 - mode
	spectrograph0 - mode
	infrared3 - mode
	GroundStation2 - direction
	Star6 - direction
	GroundStation7 - direction
	GroundStation3 - direction
	Star8 - direction
	Star4 - direction
	GroundStation5 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Star12 - direction
	Planet13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 infrared3)
	(supports instrument1 spectrograph0)
	(supports instrument1 spectrograph4)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 image5)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star11)
	(supports instrument3 image5)
	(calibration_target instrument3 GroundStation5)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 Star8)
	(supports instrument4 image5)
	(supports instrument4 image6)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 GroundStation1)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
)
(:goal (and
	(pointing satellite0 GroundStation0)
	(pointing satellite1 Star8)
	(have_image Planet9 spectrograph4)
	(have_image Phenomenon10 thermograph2)
	(have_image Phenomenon10 spectrograph0)
	(have_image Star11 thermograph2)
	(have_image Star11 image6)
	(have_image Star12 infrared3)
	(have_image Star12 image1)
	(have_image Planet13 image1)
	(have_image Star14 image5)
	(have_image Star14 thermograph2)
))

)

; plan
1. (turn_to satellite0 groundstation3 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 12
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 12
3. (calibrate satellite0 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 0 of 12
4. (turn_to satellite0 star12 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star12)
   goals met: 0 of 12
5. (take_image satellite0 star12 instrument1 infrared3)
   added: (have_image star12 infrared3)
   goals met: 1 of 12
6. (turn_to satellite0 planet9 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 planet9)
   goals met: 1 of 12
7. (take_image satellite0 planet9 instrument1 spectrograph4)
   added: (have_image planet9 spectrograph4)
   goals met: 2 of 12
8. (turn_to satellite0 groundstation5 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 groundstation5)
   goals met: 2 of 12
9. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 2 of 12
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 12
11. (calibrate satellite0 instrument0 groundstation5)
   added: (calibrated instrument0)
   goals met: 2 of 12
12. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 2 of 12
13. (turn_to satellite0 phenomenon10 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 12
14. (take_image satellite0 phenomenon10 instrument0 spectrograph0)
   added: (have_image phenomenon10 spectrograph0)
   goals met: 3 of 12
15. (turn_to satellite0 planet13 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet13)
   goals met: 3 of 12
16. (take_image satellite0 planet13 instrument0 image1)
   added: (have_image planet13 image1)
   goals met: 4 of 12
17. (turn_to satellite0 star12 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star12)
   goals met: 4 of 12
18. (take_image satellite0 star12 instrument0 image1)
   added: (have_image star12 image1)
   goals met: 5 of 12
19. (turn_to satellite0 groundstation0 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 groundstation0)
   goals met: 6 of 12
20. (turn_to satellite1 groundstation0 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 groundstation0)
   goals met: 6 of 12
21. (calibrate satellite1 instrument4 groundstation0)
   added: (calibrated instrument4)
   goals met: 6 of 12
22. (turn_to satellite1 phenomenon10 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon10)
   goals met: 6 of 12
23. (take_image satellite1 phenomenon10 instrument4 thermograph2)
   added: (have_image phenomenon10 thermograph2)
   goals met: 7 of 12
24. (turn_to satellite1 star11 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 star11)
   goals met: 7 of 12
25. (take_image satellite1 star11 instrument4 image6)
   added: (have_image star11 image6)
   goals met: 8 of 12
26. (take_image satellite1 star11 instrument4 thermograph2)
   added: (have_image star11 thermograph2)
   goals met: 9 of 12
27. (turn_to satellite1 star14 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star14)
   goals met: 9 of 12
28. (take_image satellite1 star14 instrument4 image5)
   added: (have_image star14 image5)
   goals met: 10 of 12
29. (take_image satellite1 star14 instrument4 thermograph2)
   added: (have_image star14 thermograph2)
   goals met: 11 of 12
30. (turn_to satellite1 star8 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star8)
   goals met: 12 of 12
